artillery-tests/reports/caching-disabled-high-load-west-us.txt
http.codes.200: ................................................................ 7840
http.codes.201: ................................................................ 490
http.codes.204: ................................................................ 245
http.downloaded_bytes: ......................................................... 2205000
http.request_rate: ............................................................. 151/sec
http.requests: ................................................................. 8575
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 5150
  median: ...................................................................... 391.6
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1826.6
http.responses: ................................................................ 8575
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 245
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 245
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 7350
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 245
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 245
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 245
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 33
  max: ......................................................................... 1934
  median: ...................................................................... 632.8
  p95: ......................................................................... 1495.5
  p99: ......................................................................... 1863.5
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 40
  max: ......................................................................... 2054
  median: ...................................................................... 383.8
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1556.5
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 2
  max: ......................................................................... 2667
  median: ...................................................................... 407.5
  p95: ......................................................................... 1224.4
  p99: ......................................................................... 1790.4
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 2
  max: ......................................................................... 2620
  median: ...................................................................... 361.5
  p95: ......................................................................... 1790.4
  p99: ......................................................................... 2566.3
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 7
  max: ......................................................................... 5150
  median: ...................................................................... 214.9
  p95: ......................................................................... 1130.2
  p99: ......................................................................... 3262.4
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 4
  max: ......................................................................... 2033
  median: ...................................................................... 228.2
  p95: ......................................................................... 889.1
  p99: ......................................................................... 982.6
vusers.completed: .............................................................. 245
vusers.created: ................................................................ 245
vusers.created_by_name.House Flow: ............................................. 245
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8392.7
  max: ......................................................................... 30626.4
  median: ...................................................................... 22254.1
  p95: ......................................................................... 27730.6
  p99: ......................................................................... 28862.3