artillery-tests/reports/caching-disabled-high-load.txt
http.codes.200: ................................................................ 7840
http.codes.201: ................................................................ 490
http.codes.204: ................................................................ 245
http.downloaded_bytes: ......................................................... 2205000
http.request_rate: ............................................................. 152/sec
http.requests: ................................................................. 8575
http.response_time:
  min: ......................................................................... 37
  max: ......................................................................... 1843
  median: ...................................................................... 237.5
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1353.1
http.responses: ................................................................ 8575
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 245
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 245
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 7350
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 245
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 245
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 245
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 57
  max: ......................................................................... 1843
  median: ...................................................................... 632.8
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1652.8
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 69
  max: ......................................................................... 1428
  median: ...................................................................... 295.9
  p95: ......................................................................... 925.4
  p99: ......................................................................... 1274.3
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 37
  max: ......................................................................... 1727
  median: ...................................................................... 262.5
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1353.1
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 52
  max: ......................................................................... 1505
  median: ...................................................................... 219.2
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1300.1
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 52
  max: ......................................................................... 381
  median: ...................................................................... 58.6
  p95: ......................................................................... 159.2
  p99: ......................................................................... 278.7
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 56
  max: ......................................................................... 235
  median: ...................................................................... 63.4
  p95: ......................................................................... 94.6
  p99: ......................................................................... 169
vusers.completed: .............................................................. 245
vusers.created: ................................................................ 245
vusers.created_by_name.House Flow: ............................................. 245
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1858.6
  max: ......................................................................... 26246.1
  median: ...................................................................... 15218.6
  p95: ......................................................................... 20958.1
  p99: ......................................................................... 24107.7